# Чтение и запись данных, часть 2

## Домашнее задание 

### Описание домашнего задания и формат сдачи

Выполните предложенные задачи — впишите свой код в ячейки после комментария `### YOUR CODE HERE ###` и сохраните изменения, используя опцию *Save and Checkpoint* из вкладки меню *File* или кнопку *Save and Checkpoint* на панели инструментов. Итоговый файл в формате `.ipynb` (файл Jupyter Notebook) загрузите в личный кабинет и отправьте на проверку.

In [1]:
import pandas as pd
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import pymongo

### Задача 1

Используя сервис MetaWeather узнайте, какая погода была в Лондоне 1 марта 2019 года. Для этого в первой ячейке определите идентификатор Лондона в этом сервисе, а во второй — запросите данные погоды. Обратите внимание, что сервис вернёт данные за несколько дней, а не только за 1 марта, в этой задаче это допустимо.

In [2]:
url = "https://www.metaweather.com/api/location/search/?query=london"

In [3]:
with req.urlopen(url) as session:
    response1 = session.read().decode()
    data = json.loads(response1)
data[0]

{'title': 'London',
 'location_type': 'City',
 'woeid': 44418,
 'latt_long': '51.506321,-0.12714'}

In [4]:
url = f"https://www.metaweather.com/api/location/{data[0]['woeid']}/2019/03/01/"

with req.urlopen(url) as session:
    response1 = session.read().decode()
    data = json.loads(response1)

data[0]

{'id': 4706336925286400,
 'weather_state_name': 'Showers',
 'weather_state_abbr': 's',
 'wind_direction_compass': 'W',
 'created': '2019-03-01T21:59:01.944736Z',
 'applicable_date': '2019-03-01',
 'min_temp': 7.593333333333334,
 'max_temp': 12.533333333333333,
 'the_temp': 12.055,
 'wind_speed': 4.989812600347968,
 'wind_direction': 271.4307338494283,
 'air_pressure': 1017.6800000000001,
 'humidity': 74,
 'visibility': 6.465988626421697,
 'predictability': 73}

### Задача 2

Сохраните данные погоды, полученные в предыдущей задаче, в файл `weather.json`. При сохранении используйте четыре пробела для форматирования.

In [20]:
with open('weather.json', 'w') as file:
    json.dump(data, file, indent=4)

### Задача 3

Загрузите содержимое файла `weather.json` в DataFrame и выведите первые пять строк DataFrame на экран.

In [23]:
df_weather = pd.read_json('weather.json')
df_weather.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,4706336925286400,Showers,s,W,2019-03-01T21:59:01.944736Z,2019-03-01,7.593333,12.533333,12.055,4.989813,271.430734,1017.68,74,6.465989,73
1,5349522672713728,Showers,s,W,2019-03-01T18:57:01.981049Z,2019-03-01,7.593333,12.533333,12.055,5.207913,276.650124,1017.18,73,6.667624,73
2,4529216366313472,Showers,s,W,2019-03-01T15:55:02.886405Z,2019-03-01,7.593333,12.533333,12.055,5.207913,276.650124,1017.18,73,6.667624,73
3,4582457049350144,Showers,s,W,2019-03-01T12:53:01.886400Z,2019-03-01,7.593333,12.533333,12.055,5.207913,276.650124,1017.18,73,6.667624,73
4,6272821925773312,Showers,s,W,2019-03-01T09:51:02.485187Z,2019-03-01,7.593333,12.533333,12.185,4.531242,271.430734,1017.18,75,7.897628,73

### Задача 4

Сохраните DataFrame из предыдущей задачи в файл `result.csv`. В качестве названия столбца-индекса используйте `index`.

In [24]:
df_weather.to_csv('results.csv', index_label='index')

### Задача 5

Загрузите содержимое SQL-таблицы `ratings` в DataFrame. Выведите первые пять строк DataFrame на экран. Для подключения к БД используйте строку подключения, указанную в следующей ячейке.

In [25]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()

['keywords',
 'links',
 'ratings',
 'exploratory',
 'new_table',
 'course_purchases',
 'users',
 'joi',
 'studentt']

In [28]:
df_ratings = pd.read_sql("SELECT * FROM ratings", connect)
df_ratings.head()

   userid  movieid  rating  timestamp
0    4323      345     3.0  963237583
1    4323      348     3.0  948727890
2    4323      353     4.0  942843433
3    4323      356     4.0  941457725
4    4323      357     4.0  959099337

### Задача 6

Сохраните первые 10000 записей датафрейма из предыдущей задачи в файл `result2.xlsx`, при сохранении задайте листу имя `MySheet`.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр `sheet_name`)

In [29]:
df_ratings.iloc[:1000,:].to_excel('results2.xlsx', sheet_name='MySheet')

### Задача 7

Определите количество документов в коллекции `users` в MongoDB. Если количество документов < 1000, то в следующей ячейке загрузите всё содержимое этой коллекции в список и выведите нулевой элемент этого списка на экран. Для подключения к MongoDB используйте строку подключения, указанную в следующей ячейке.

In [39]:
conn = 'mongodb://students:X63673t47Gl03Sq@dsstudents.skillbox.ru:27017/?authSource=movies'

client = pymongo.MongoClient(conn)
db = client['movies']
users = db['users']
users.count_documents(filter={})

100

In [42]:
all_users = list(users.find())
all_users[0]

{'_id': ObjectId('5cc69095067496679c74f7a4'),
 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892',
 'first_name': 'Жанна',
 'last_name': 'Петрова',
 'mail': 'zhanna_03816@gmail.com',
 'age': 20.0}

### Задача 8

Преобразуйте список всех документов коллекции `users` из предыдущей задачи в pandas DataFrame и сохраните его содержимое в файл `result3.xlsx`.

In [45]:
df_users = pd.DataFrame(all_users)
df_users.to_excel('results3.xlsx', sheet_name='Users')

## Дополнительные (необязательные) задачи

### Задача 9

Используя данные SQL-таблицы `ratings`, для каждого пользователя (столбец `userid`) определите средний рейтинг, который этот пользователь поставил фильмам. Результат выведите на экран. 

Группировку проведите двумя способами: с помощью `GROUP BY` в строке запроса к БД и с использованием метода `groupby` в pandas.

Для подключения к БД используйте строку подключения в следующей ячейке

In [49]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

In [52]:
df = pd.read_sql("SELECT userid, AVG(rating) FROM ratings GROUP BY userid", connect)
df.head(10)

   userid       avg
0    6114  4.000000
1    4790  4.000000
2     273  4.314685
3    3936  3.756757
4    5761  3.419220
5    5468  1.666667
6    7662  3.263736
7    4326  3.337838
8    2520  4.001401
9    2466  3.437500

In [57]:
df = pd.read_sql("SELECT * FROM ratings", connect)
df.groupby('userid')[['rating']].mean().head(10)

          rating
userid
1       4.277778
2       3.318182
3       3.100000
4       3.500000
5       4.269231
6       3.750000
7       3.367925
8       2.991150
9       3.851190
10      4.230769

### Задача 10

Объедините таблицы `ratings` и `keywords` по столбцам `movieid` (используйте левое объединение). Объединение проведите двумя способами: с помощью `LEFT JOIN` в строке запроса к БД и с использованием метода `merge` в pandas. Результат объединения загрузите в DataFrame и сохраните в файл `result4.csv`.

Обратите внимание, что при объединении возможно дублирование столбцов. В результирующем датафрейме не должно быть таких дублированных столбцов.

In [63]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

In [64]:
query = "SELECT DISTINCT * FROM ratings " \
        "LEFT JOIN keywords ON keywords.movieid = ratings.movieid"
df1 = pd.read_sql(query, connect)

In [65]:
df1.head()

,userid,movieid,rating,timestamp,movieid,tags
0,1,110,1.0,1425941529,110.0,"[{'id': 934, 'name': 'judge'}, {'id': 1533, 'n..."
1,1,147,4.5,1425942435,147.0,"[{'id': 6930, 'name': 'fondling'}, {'id': 1018..."
2,1,858,5.0,1425941523,858.0,"[{'id': 494, 'name': 'father son relationship'..."
3,1,1221,5.0,1425941546,NaN,None
4,1,1246,5.0,1425941556,1246.0,"[{'id': 276, 'name': 'philadelphia'}, {'id': 3..."

In [66]:
df2 = pd.read_sql("SELECT * FROM ratings", connect)
df3 = pd.read_sql("SELECT * FROM keywords", connect)
df4 = df2.merge(right=df3, on='movieid', how='left').drop_duplicates()
df4.head()

,userid,movieid,rating,timestamp,tags
0,4323,345,3.0,963237583,"[{'id': 314, 'name': 'life and death'}, {'id':..."
2,4323,348,3.0,948727890,"[{'id': 803, 'name': 'android'}, {'id': 1825, ..."
4,4323,353,4.0,942843433,NaN
5,4323,356,4.0,941457725,NaN
6,4323,357,4.0,959099337,NaN

### Задача 11

Используя объединенную таблицу из предыдущего задания, найдите все идентификаторы фильмов с тегом `africa` (но не `south africa` или любые другие). Список тегов в формате JSON записан в столбце `tags`.

In [73]:
df4['tags'] = df4['tags'].fillna('')

In [75]:
df5 = df4[df4['tags'].str.contains('africa') & ~df4['tags'].str.contains('south africa')]
df5.head()

,userid,movieid,rating,timestamp,tags
49,4323,494,3.0,1124114243,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
2072,4323,25874,3.0,1274215566,"[{'id': 409, 'name': 'africa'}, {'id': 2043, '..."
3442,4331,494,3.0,853851055,"[{'id': 90, 'name': 'paris'}, {'id': 409, 'nam..."
3842,4334,1672,3.0,947685529,"[{'id': 90, 'name': 'paris'}, {'id': 378, 'nam..."
6921,4351,1672,3.5,1392247651,"[{'id': 90, 'name': 'paris'}, {'id': 378, 'nam..."

In [79]:
df5['tags'].to_numpy()[:5]

array(["[{'id': 90, 'name': 'paris'}, {'id': 409, 'name': 'africa'}, {'id': 2173, 'name': 'illegal immigration'}, {'id': 5946, 'name': 'ethiopia'}, {'id': 6019, 'name': 'human trafficking'}, {'id': 6277, 'name': 'language course'}, {'id': 7540, 'name': 'circumcision'}, {'id': 10601, 'name': 'blaxploitation'}]",
       "[{'id': 409, 'name': 'africa'}, {'id': 2043, 'name': 'lion'}, {'id': 2964, 'name': 'future'}, {'id': 3206, 'name': 'story teller'}, {'id': 3298, 'name': 'hallucination'}, {'id': 4563, 'name': 'virtual reality'}, {'id': 5386, 'name': 'tramp'}, {'id': 9743, 'name': 'stranded'}, {'id': 9820, 'name': 'alternate dimension'}, {'id': 9831, 'name': 'spaceship'}, {'id': 9893, 'name': 'lioness'}, {'id': 10150, 'name': 'end of the world'}, {'id': 10158, 'name': 'alien planet'}, {'id': 10349, 'name': 'survival'}, {'id': 10536, 'name': 'rocket crash'}, {'id': 10629, 'name': 'vision'}, {'id': 11669, 'name': 'multiple time frames'}, {'id': 206230, 'name': 'eutanasia'}]",
       "[{'id': 90, 'name': 'paris'}, {'id': 409, 'name': 'africa'}, {'id': 2173, 'name': 'illegal immigration'}, {'id': 5946, 'name': 'ethiopia'}, {'id': 6019, 'name': 'human trafficking'}, {'id': 6277, 'name': 'language course'}, {'id': 7540, 'name': 'circumcision'}, {'id': 10601, 'name': 'blaxploitation'}]",
       "[{'id': 90, 'name': 'paris'}, {'id': 378, 'name': 'prison'}, {'id': 409, 'name': 'africa'}, {'id': 960, 'name': 'homeless person'}, {'id': 1157, 'name': 'wife husband relationship'}, {'id': 2051, 'name': 'intelligence'}, {'id': 9748, 'name': 'revenge'}, {'id': 9777, 'name': 'escape from prison'}]",
       "[{'id': 90, 'name': 'paris'}, {'id': 378, 'name': 'prison'}, {'id': 409, 'name': 'africa'}, {'id': 960, 'name': 'homeless person'}, {'id': 1157, 'name': 'wife husband relationship'}, {'id': 2051, 'name': 'intelligence'}, {'id': 9748, 'name': 'revenge'}, {'id': 9777, 'name': 'escape from prison'}]"],
      dtype=object)